Автосервис/src/Documents/ЗаписьВСервис/ЗаписьВСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьВСервис</name>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.ВладельцыАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.АвтомобилиКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОбращения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.Калькуляция</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКалькуляции</name>
    <type>
      <types>EnumRef.ВариантыКалькуляции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Автодеталь</name>
      <type>
        <types>CatalogRef.Автодетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДетальКлиента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Автосервис/src/InformationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьМатериалов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автосервис/src/Documents/ЗаписьВСервис/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура МатериалыДетальКлиентаПриИзменении(Элемент)
	ДетальКлиента = Элементы.Материалы.ТекущиеДанные.ДетальКлиента;
	Если Не ДетальКлиента Тогда
		Материал = Элементы.Материалы.ТекущиеДанные.Материал;
		Количество = Элементы.Материалы.ТекущиеДанные.Количество;
		Цена = ПолучитьЦену(Материал);
		Элементы.Материалы.ТекущиеДанные.Цена = Цена;
		Элементы.Материалы.ТекущиеДанные.Сумма = Цена * Количество;
	Иначе
		Элементы.Материалы.ТекущиеДанные.Цена = 0;
		Элементы.Материалы.ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЦену(Материал)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СтоимостьМатериалов.Материал,
	|	СтоимостьМатериалов.Стоимость
	|ИЗ
	|	РегистрСведений.СтоимостьМатериалов КАК СтоимостьМатериалов
	|ГДЕ
    |   СтоимостьМатериалов.Материал = &Материал";
    Запрос.УстановитьПараметр(
        "Материал", Материал    
    );
    РезультатЗапроса = Запрос.Выполнить();
    Записи = РезультатЗапроса.Выбрать();
    Пока Записи.Следующий() Цикл
        Возврат Записи.Стоимость;
    КонецЦикла;
КонецФункции


&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	Материал = Элементы.Материалы.ТекущиеДанные.Материал;
	Количество = Элементы.Материалы.ТекущиеДанные.Количество;
	Цена = ПолучитьЦену(Материал);
	Элементы.Материалы.ТекущиеДанные.Цена = Цена;
	Элементы.Материалы.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры

&НаКлиенте
Процедура РаботыПередУдалением(Элемент, Отказ)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	КолВо = Объект.Материалы.Количество()-1; 
	ИндексСтроки = КолВо; 
	Для Счетчик = 0 по КолВо Цикл 
		Запись = Объект.Материалы.Получить(ИндексСтроки); 
		Если Запись.СсылкаНаРаботу=СтрокаТабличнойЧасти.Работа тогда 
			Объект.Материалы.Удалить(Запись);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1; 
	КонецЦикла;
	Сообщить("Количество деталей " + Объект.Материалы.Количество());
КонецПроцедуры
&НаКлиенте
Процедура УдалитьДеталиПриИзмененииРаботы()
	КолВо = Объект.Материалы.Количество()-1; 
	ИндексСтроки = КолВо; 
	Для Счетчик = 0 по КолВо Цикл 
		Запись = Объект.Материалы.Получить(ИндексСтроки);
		ДетальНаУдаление = Истина;
		Для Каждого СтрокаРабота Из Объект.Работы Цикл
			Если Запись.СсылкаНаРаботу=СтрокаРабота.Работа Тогда
				ДетальНаУдаление = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ДетальНаУдаление Тогда
			Объект.Материалы.Удалить(Запись);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1; 
	КонецЦикла;
	Сообщить("Деталей перед добавлением новых " + Объект.Материалы.Количество());
КонецПроцедуры


&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	РаботыПриАктивизацииСтроки(Элемент);
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	КоличествоРабот = СтрокаТабличнойЧасти.Количество;
	Детали = ПолучитьДеталиРаботыСУчетомКоличество(СтрокаТабличнойЧасти.Работа,КоличествоРабот );
	  
	УдалитьДеталиПриИзмененииРаботы();
	  
	Для Каждого СтрокаДетали Из Детали Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
	  	НоваяСтрока.Автодеталь = СтрокаДетали.Автодеталь;
	  	НоваяСтрока.Количество = СтрокаДетали.Количество;
	  	НоваяСтрока.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа;
  	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриАктивизацииСтроки(Элемент)
	СтрокаРаботы = Элементы.Работы.ТекущиеДанные;
    Если СтрокаРаботы = Неопределено Или СтрокаРаботы.Работа = Неопределено Тогда
     	Элементы.Материалы.ОтборСтрок = Неопределено;
     	Элементы.Материалы.Обновить();
     	Возврат
    КонецЕсли;
    Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура("СсылкаНаРаботу", СтрокаРаботы.Работа);
    Элементы.Материалы.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	Если Объект.Автомобиль = Неопределено Тогда
		Объект.МаркаАвтомобиля = Неопределено;
		Объект.МодельАвтомобиля = Неопределено;
	Иначе
		Автомобиль = ПолучитьМодельИМаркуАвтомобиля(Объект.Автомобиль);
		Объект.МаркаАвтомобиля = Автомобиль.Марка;
		Объект.МодельАвтомобиля = Автомобиль.Модель;
		Сообщить("Марка - " + Объект.МаркаАвтомобиля + "Модель " + Объект.МодельАвтомобиля);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьМодельИМаркуАвтомобиля(СсылкаАвтомобиль)
	Автомобиль = СсылкаАвтомобиль.ПолучитьОбъект();
	СтруктураАвтомобиля = Новый Структура;
	СтруктураАвтомобиля.Вставить("Марка", Автомобиль.Марка);
	СтруктураАвтомобиля.Вставить("Модель", Автомобиль.Модель);
	
	Возврат СтруктураАвтомобиля;
	
КонецФункции

&НаСервере
Функция ПолучитьДеталиРаботыСУчетомКоличество(Работа, КоличествоРабот)
    Если Работа = Неопределено Или Работа.Пустая() Тогда
        Возврат Новый Массив;
    КонецЕсли;
    РаботаОбъект = Работа.ПолучитьОбъект();
    МассивДеталей = Новый Массив;
    Для Каждого СтрокаСпец Из РаботаОбъект.СпецификацияМатериалов Цикл
        СтруктураДетали = Новый Структура;

        СтруктураДетали.Вставить("Автодеталь", СтрокаСпец.Автодеталь);
        СтруктураДетали.Вставить("Количество", СтрокаСпец.Количество * КоличествоРабот);

        МассивДеталей.Добавить(СтруктураДетали);
    КонецЦикла;

    Возврат МассивДеталей;

КонецФункции

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	 СтрокаТабличнойЧасти.НормаЧасов = РассчитатьНормаЧасы(СтрокаТабличнойЧасти.Работа, СтрокаТабличнойЧасти.Количество);
	 НовыеДетали = ПолучитьДеталиРаботыСУчетомКоличество(
        СтрокаТабличнойЧасти.Работа,
        СтрокаТабличнойЧасти.Количество
     );
     Для Каждого СтрокаАвто Из Объект.Материалы Цикл
        Если СтрокаАвто.СсылкаНаРаботу = СтрокаТабличнойЧасти.Работа Тогда
            Для Каждого Д Из НовыеДетали Цикл
                Если Д.Автодеталь = СтрокаАвто.Автодеталь Тогда
                    СтрокаАвто.Количество = Д.Количество;
                    Если СтрокаАвто.Материал <> Неопределено Тогда
                    	СтрокаАвто.Сумма = СтрокаАвто.Цена * Д.Количество;
                    КонецЕсли;
                    
                КонецЕсли
            КонецЦикла;

        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КалькуляцияПриИзменении(Элемент)
    
    ОбновитьВсеДанные();
 
КонецПроцедуры

&НаКлиенте
Процедура ВариантКалькуляцииПриИзменении(Элемент)
    
    Сообщить("Сработало2");
    ОбновитьВсеДанные();
    
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьТаблицуРабот(МассивРабот)
    
    Сообщить("Начало заполнения таблицы работ, количество: " + МассивРабот.Количество());
    
    // Очищаем табличную часть
    Объект.Работы.Очистить();
    
    // Заполняем работы из массива
    Для Каждого Элемент Из МассивРабот Цикл
        НоваяСтрока = Объект.Работы.Добавить();
        
        // Основные поля (проверяем наличие в структуре)
        Если Элемент.Свойство("Работа") Тогда
            НоваяСтрока.Работа = Элемент.Работа;
        КонецЕсли;
        
        Если Элемент.Свойство("НормаЧасов") Тогда
            НоваяСтрока.НормаЧасов = Элемент.НормаЧасов;
        КонецЕсли;
        
        Если Элемент.Свойство("Нормачас") Тогда
            НоваяСтрока.НормаЧасов = Элемент.Нормачас;
        КонецЕсли;
        
        Если Элемент.Свойство("Количество") Тогда
            НоваяСтрока.Количество = Элемент.Количество;
        КонецЕсли;
        
        Если Элемент.Свойство("Автодеталь") Тогда
            НоваяСтрока.Автодеталь = Элемент.Автодеталь;
        КонецЕсли;
        
    КонецЦикла;
    
    // Обновляем отображение таблицы
    Элементы.Работы.Обновить();
    
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТаблицуАвтодеталей(МассивАвтодеталей)
    
    // Очищаем табличную часть материалов (автодеталей)
    Объект.Материалы.Очистить();
    
    // Заполняем автодетали из массива
    Для Каждого Элемент Из МассивАвтодеталей Цикл
        НоваяСтрока = Объект.Материалы.Добавить();
        
        // Автодеталь и количество
        Если Элемент.Свойство("Автодеталь") Тогда
            НоваяСтрока.Автодеталь = Элемент.Автодеталь;
        КонецЕсли;
        
        Если Элемент.Свойство("Количество") Тогда
            НоваяСтрока.Количество = Элемент.Количество;
        КонецЕсли;
        
        // Материал, цена и сумма
        Если Элемент.Свойство("Материал") Тогда
            НоваяСтрока.Материал = Элемент.Материал;
        КонецЕсли;
        
        Если Элемент.Свойство("Цена") Тогда
            НоваяСтрока.Цена = Элемент.Цена;
        КонецЕсли;
        
        Если Элемент.Свойство("Сумма") Тогда
            НоваяСтрока.Сумма = Элемент.Сумма;
        КонецЕсли;
        
        Если Элемент.Свойство("СсылкаНаРаботу") Тогда
        	НоваяСтрока.СсылкаНаРаботу = Элемент.СсылкаНаРаботу;
        КонецЕсли;
        
        // Поле "Деталь клиента" - по умолчанию ЛОЖЬ
        Если НоваяСтрока.Свойство("ДетальКлиента") Тогда
            НоваяСтрока.ДетальКлиента = Ложь;
        КонецЕсли;
        
    КонецЦикла;
    
    // Обновляем отображение таблицы
    Элементы.Материалы.Обновить();
    
КонецПроцедуры


&НаСервере
Функция ЗаполнитьИзКалькуляцииНаСервере(СсылкаКалькуляции, ВариантКалькуляции)
    
    Результат = Новый Структура;
    
    Если Не ЗначениеЗаполнено(СсылкаКалькуляции) Тогда
        Возврат Результат;
    КонецЕсли;
    
    // Получаем объект калькуляции
    ДокументОбъект = СсылкаКалькуляции.ПолучитьОбъект();
    АвтомобильОбъект = ДокументОбъект.Автомобиль.ПолучитьОбъект();
    
    // Заполняем структуру данными
    Результат.Вставить("Клиент", ДокументОбъект.Клиент);
    Результат.Вставить("Автомобиль", ДокументОбъект.Автомобиль);
    Результат.Вставить("ПричинаОбращения", ДокументОбъект.ПричинаОбращения);
    Результат.Вставить("МаркаАвтомобиля", АвтомобильОбъект.Марка);
	Результат.Вставить("МодельАвтомобиля", АвтомобильОбъект.Модель);
    
    // Для табличных частей - конвертируем в массив структур
    Результат.Вставить("Работы", ТаблицаЗначенийВМассив(ДокументОбъект.Работы.Выгрузить()));
    
    // Автодетали по выбранному варианту
    Результат.Вставить("Автодетали", ПолучитьАвтодеталиПоВарианту(ДокументОбъект, ВариантКалькуляции));
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Функция ТаблицаЗначенийВМассив(Таблица)
    
    Массив = Новый Массив;
    
    Для Каждого СтрокаТаблицы Из Таблица Цикл
        СтруктураСтроки = Новый Структура();
        
        // Копируем все колонки из строки таблицы
        Для Каждого Колонка Из Таблица.Колонки Цикл
            ИмяКолонки = Колонка.Имя;
            СтруктураСтроки.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
        КонецЦикла;
        
        Массив.Добавить(СтруктураСтроки);
        
        // Для отладки - выводим строку
        // Сообщить("Добавлена строка: " + СтрокаТаблицы.Работа + ", часов: " + СтрокаТаблицы.НормаЧасов);
    КонецЦикла;
    
    Возврат Массив;
    
КонецФункции


&НаСервере
Функция ПолучитьАвтодеталиПоВарианту(ДокументОбъект, ВариантКалькуляции)
    
    МассивАвтодеталей = Новый Массив;
    
    // Если вариант не выбран - НИЧЕГО не возвращаем
    Если Не ЗначениеЗаполнено(ВариантКалькуляции) Тогда
        Сообщить("Вариант калькуляции не выбран");
        Возврат МассивАвтодеталей;
    КонецЕсли;
    
    // Получаем имя варианта
    ИмяВарианта = Строка(ВариантКалькуляции);
    Сообщить("Имя варианта (строка): " + ИмяВарианта);
    
    // Определяем номер варианта (1, 2 или 3)
    НомерВарианта = 1; // По умолчанию
    
    Если ИмяВарианта = "Вариант1" Тогда
        НомерВарианта = 1;
    ИначеЕсли ИмяВарианта = "Вариант2" Тогда
        НомерВарианта = 2;
    ИначеЕсли ИмяВарианта = "Вариант3" Тогда
        НомерВарианта = 3;
    Иначе
        Попытка
            Если Найти(ИмяВарианта, "1") > 0 Тогда
                НомерВарианта = 1;
            ИначеЕсли Найти(ИмяВарианта, "2") > 0 Тогда
                НомерВарианта = 2;
            ИначеЕсли Найти(ИмяВарианта, "3") > 0 Тогда
                НомерВарианта = 3;
            КонецЕсли;
        Исключение
            НомерВарианта = 1;
        КонецПопытки;
    КонецЕсли;
    
    // Проходим по всем строкам автодеталей в калькуляции
    Для Каждого СтрокаАвтодетали Из ДокументОбъект.Автодетали Цикл
        
        Материал = Неопределено;
        Цена = 0;
        Сумма = 0;
        
        // В зависимости от выбранного варианта берем соответствующие поля
        Если НомерВарианта = 1 Тогда
            Материал = СтрокаАвтодетали.Материал1;
            Цена = СтрокаАвтодетали.Цена1;
            Сумма = СтрокаАвтодетали.Сумма1;
            
        ИначеЕсли НомерВарианта = 2 Тогда
            Материал = СтрокаАвтодетали.Материал2;
            Цена = СтрокаАвтодетали.Цена2;
            Сумма = СтрокаАвтодетали.Сумма2;
            
        ИначеЕсли НомерВарианта = 3 Тогда
            Материал = СтрокаАвтодетали.Материал3;
            Цена = СтрокаАвтодетали.Цена3;
            Сумма = СтрокаАвтодетали.Сумма3;
            
        КонецЕсли;
        
        // Если материал для выбранного варианта заполнен
        Если ЗначениеЗаполнено(Материал) Тогда
            
            СтруктураАвтодетали = Новый Структура();
            
            // Основные поля
            СтруктураАвтодетали.Вставить("Автодеталь", СтрокаАвтодетали.Автодеталь);
            СтруктураАвтодетали.Вставить("Количество", СтрокаАвтодетали.Количество);
            
            // Данные из выбранного варианта
            СтруктураАвтодетали.Вставить("Материал", Материал);
            СтруктураАвтодетали.Вставить("Цена", Цена);
            СтруктураАвтодетали.Вставить("Сумма", Сумма);
            
            // Ссылка на работу (если есть)
            Если ЗначениеЗаполнено(СтрокаАвтодетали.СсылкаНаРаботу) Тогда
                СтруктураАвтодетали.Вставить("СсылкаНаРаботу", СтрокаАвтодетали.СсылкаНаРаботу);
            КонецЕсли;
            
            МассивАвтодеталей.Добавить(СтруктураАвтодетали);
            
            Сообщить("Добавлена автодеталь: " + СтрокаАвтодетали.Автодеталь + 
                    " -> материал: " + Материал + 
                    ", цена: " + Цена + 
                    ", количество: " + СтрокаАвтодетали.Количество);
        КонецЕсли;
        
    КонецЦикла;
    
    Сообщить("Всего автодеталей: " + МассивАвтодеталей.Количество());
    
    Возврат МассивАвтодеталей;
    
КонецФункции


&НаКлиенте
Процедура ОбновитьВсеДанные()
    
    Сообщить("=== ОбновитьВсеДанные ===");
    
    // Если калькуляция не выбрана - очищаем всё
    Если НЕ ЗначениеЗаполнено(Объект.Калькуляция) Тогда
        Объект.Клиент = Неопределено;
        Объект.Автомобиль = Неопределено;
        Объект.ПричинаОбращения = Неопределено;
        Объект.МаркаАвтомобиля = Неопределено;
        Объект.МодельАвтомобиля = Неопределено;
        Объект.Работы.Очистить();
        Объект.Материалы.Очистить();
        Элементы.Работы.Обновить();
        Элементы.Материалы.Обновить();
        Возврат;
    КонецЕсли;

    // Получаем данные с сервера
    Данные = ЗаполнитьИзКалькуляцииНаСервере(Объект.Калькуляция, Объект.ВариантКалькуляции);
    
    // Заполняем основные поля
    Объект.Клиент = Данные.Клиент;
    Объект.Автомобиль = Данные.Автомобиль;
    Объект.ПричинаОбращения = Данные.ПричинаОбращения;
    Объект.МаркаАвтомобиля = Данные.МаркаАвтомобиля;
    Объект.МодельАвтомобиля = Данные.МодельАвтомобиля;
    
    // Заполняем табличные части
    ЗаполнитьТаблицуРабот(Данные.Работы);
    ЗаполнитьТаблицуАвтодеталей(Данные.Автодетали);
    
КонецПроцедуры


&НаСервере
Функция РассчитатьНормаЧасы(Работа, Количество)
	Если Работа = Неопределено Или Работа.Пустая() Тогда
        Возврат 0;
    КонецЕсли;
	РаботаОбъект = Работа.ПолучитьОбъект();
	Возврат РаботаОбъект.НормаЧас * Количество
КонецФункции
